{
  "architectures": [
    "SiglipForImageClassification"
  ],
  "id2label": {
    "0": "arbor woodland",
    "1": "artificial grassland",
    "2": "dry cropland",
    "3": "garden plot",
    "4": "industrial land",
    "5": "irrigated land",
    "6": "lake",
    "7": "natural grassland",
    "8": "paddy field",
    "9": "pond",
    "10": "river",
    "11": "rural residential",
    "12": "shrub land",
    "13": "traffic land",
    "14": "urban residential"
  },
  "initializer_factor": 1.0,
  "label2id": {
    "arbor woodland": 0,
    "artificial grassland": 1,
    "dry cropland": 2,
    "garden plot": 3,
    "industrial land": 4,
    "irrigated land": 5,
    "lake": 6,
    "natural grassland": 7,
    "paddy field": 8,
    "pond": 9,
    "river": 10,
    "rural residential": 11,
    "shrub land": 12,
    "traffic land": 13,
    "urban residential": 14
  },
  "model_type": "siglip",
  "problem_type": "single_label_classification",
  "text_config": {
    "attention_dropout": 0.0,
    "hidden_act": "gelu_pytorch_tanh",
    "hidden_size": 768,
    "intermediate_size": 3072,
    "layer_norm_eps": 1e-06,
    "max_position_embeddings": 64,
    "model_type": "siglip_text_model",
    "num_attention_heads": 12,
    "num_hidden_layers": 12,
    "projection_size": 768,
    "torch_dtype": "float32",
    "vocab_size": 256000
  },
  "torch_dtype": "float32",
  "transformers_version": "4.50.0",
  "vision_config": {
    "attention_dropout": 0.0,
    "hidden_act": "gelu_pytorch_tanh",
    "hidden_size": 768,
    "image_size": 224,
    "intermediate_size": 3072,
    "layer_norm_eps": 1e-06,
    "model_type": "siglip_vision_model",
    "num_attention_heads": 12,
    "num_channels": 3,
    "num_hidden_layers": 12,
    "patch_size": 16,
    "torch_dtype": "float32"
  }
}
